app/controllers/maps_controller.rb

SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_map(id)
    @map = Map.find_by(id: id)