app/controllers/maps_controller.rb

  def create
    @map = Map.new(map_params)
    @map.save
---
INSERT INTO "maps" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My WorldPin"], ["url", ""], ["created_at", "2019-12-08 04:12:30.587628"], ["updated_at", "2019-12-08 04:12:30.587628"]]

  def find_map(id)
    @map = Map.find_by(id: id)
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]