app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" WHERE "pins"."map_id" = $1  [["map_id", 1]]
---
  def index
    @pins = Pin.where(map_id: params[:map_id])

INSERT INTO "pins" ("map_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["map_id", 1], ["created_at", "2019-12-05 21:47:01.526118"], ["updated_at", "2019-12-05 21:47:01.526118"]]
---
  def create
    @pin = Pin.new(pin_params)
    @pin.save

UPDATE "pins" SET "description" = $1, "name" = $2, "color" = $3, "updated_at" = $4 WHERE "pins"."id" = $5  [["description", "2dddd"], ["name", "2MACKENZIE MOORE"], ["color", "#e8028c"], ["updated_at", "2019-12-07 19:45:52.576575"], ["id", 38]]
---
  def update
    @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 24]]
---
  def destroy
    @pin.delete_all

SELECT "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_pin(id)
    @pin = Pin.find_by(id: id)